earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Adafruit Feather RP2040 (Picoprobe)
# -----------------------------------
adafruitfeatherpicoprobe.name=Adafruit Feather RP2040 (Picoprobe)
adafruitfeatherpicoprobe.vid.0=0x239a
adafruitfeatherpicoprobe.pid.0=0x0004
adafruitfeatherpicoprobe.build.usbpid=-DSERIALUSB_PID=0x80f1
adafruitfeatherpicoprobe.build.board=ADAFRUIT_FEATHER_RP2040
adafruitfeatherpicoprobe.build.mcu=cortex-m0plus
adafruitfeatherpicoprobe.build.variant=adafruitfeather
adafruitfeatherpicoprobe.upload.tool=picoprobe
adafruitfeatherpicoprobe.upload.maximum_size=8388608
adafruitfeatherpicoprobe.upload.maximum_data_size=262144
adafruitfeatherpicoprobe.upload.wait_for_upload_port=true
adafruitfeatherpicoprobe.upload.erase_cmd=
adafruitfeatherpicoprobe.serial.disableDTR=false
adafruitfeatherpicoprobe.serial.disableRTS=false
adafruitfeatherpicoprobe.build.f_cpu=125000000
adafruitfeatherpicoprobe.build.led=
adafruitfeatherpicoprobe.build.core=rp2040
adafruitfeatherpicoprobe.build.mcu=rp2040
adafruitfeatherpicoprobe.build.ldscript=memmap_default.ld
adafruitfeatherpicoprobe.build.boot2=boot2_w25x10cl_4_padded_checksum
adafruitfeatherpicoprobe.build.vid=0x239a
adafruitfeatherpicoprobe.build.pid=0x80f1
adafruitfeatherpicoprobe.build.usb_manufacturer="Adafruit"
adafruitfeatherpicoprobe.build.usb_product="Feather RP2040 (Picoprobe)"
adafruitfeatherpicoprobe.menu.flash.8388608_0=8MB (no FS)
adafruitfeatherpicoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.flash_length=8384512
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.fs_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
adafruitfeatherpicoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.flash_length=8318976
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.fs_start=276754432
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
adafruitfeatherpicoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.flash_length=8253440
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.fs_start=276688896
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
adafruitfeatherpicoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.flash_length=8122368
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.fs_start=276557824
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
adafruitfeatherpicoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.flash_length=7860224
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.fs_start=276295680
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.freq.125=125 MHz
adafruitfeatherpicoprobe.menu.freq.125.build.f_cpu=125000000L
adafruitfeatherpicoprobe.menu.freq.50=50 MHz
adafruitfeatherpicoprobe.menu.freq.50.build.f_cpu=50000000L
adafruitfeatherpicoprobe.menu.freq.100=100 MHz
adafruitfeatherpicoprobe.menu.freq.100.build.f_cpu=100000000L
adafruitfeatherpicoprobe.menu.freq.133=133 MHz
adafruitfeatherpicoprobe.menu.freq.133.build.f_cpu=133000000L
adafruitfeatherpicoprobe.menu.freq.150=150 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.150.build.f_cpu=150000000L
adafruitfeatherpicoprobe.menu.freq.175=175 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.175.build.f_cpu=175000000L
adafruitfeatherpicoprobe.menu.freq.200=200 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.200.build.f_cpu=200000000L
adafruitfeatherpicoprobe.menu.freq.225=225 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.225.build.f_cpu=225000000L
adafruitfeatherpicoprobe.menu.freq.250=250 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.250.build.f_cpu=250000000L
adafruitfeatherpicoprobe.menu.freq.275=275 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.275.build.f_cpu=275000000L
adafruitfeatherpicoprobe.menu.freq.300=300 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.300.build.f_cpu=300000000L
adafruitfeatherpicoprobe.menu.dbgport.Disabled=Disabled
adafruitfeatherpicoprobe.menu.dbgport.Disabled.build.debug_port=
adafruitfeatherpicoprobe.menu.dbgport.Serial=Serial
adafruitfeatherpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruitfeatherpicoprobe.menu.dbgport.Serial1=Serial1
adafruitfeatherpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruitfeatherpicoprobe.menu.dbgport.Serial2=Serial2
adafruitfeatherpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruitfeatherpicoprobe.menu.dbglvl.None=None
adafruitfeatherpicoprobe.menu.dbglvl.None.build.debug_level=
adafruitfeatherpicoprobe.menu.dbglvl.Core=Core
adafruitfeatherpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruitfeatherpicoprobe.menu.dbglvl.SPI=SPI
adafruitfeatherpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruitfeatherpicoprobe.menu.dbglvl.Wire=Wire
adafruitfeatherpicoprobe.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
adafruitfeatherpicoprobe.menu.dbglvl.All=All
adafruitfeatherpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
adafruitfeatherpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
adafruitfeatherpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruitfeatherpicoprobe.menu.usbstack.picosdk=Pico SDK
adafruitfeatherpicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
adafruitfeatherpicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruitfeatherpicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{build.core.path}/TinyUSB" "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

