earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Adafruit ItsyBitsy RP2040 (Picoprobe)
# -----------------------------------
adafruit_itsybitsypicoprobe.name=Adafruit ItsyBitsy RP2040 (Picoprobe)
adafruit_itsybitsypicoprobe.vid.0=0x239a
adafruit_itsybitsypicoprobe.pid.0=0x0004
adafruit_itsybitsypicoprobe.build.usbpid=-DSERIALUSB_PID=0x80fd
adafruit_itsybitsypicoprobe.build.board=ADAFRUIT_ITSYBITSY_RP2040
adafruit_itsybitsypicoprobe.build.mcu=cortex-m0plus
adafruit_itsybitsypicoprobe.build.variant=adafruit_itsybitsy
adafruit_itsybitsypicoprobe.upload.tool=picoprobe
adafruit_itsybitsypicoprobe.upload.maximum_size=8388608
adafruit_itsybitsypicoprobe.upload.maximum_data_size=262144
adafruit_itsybitsypicoprobe.upload.wait_for_upload_port=true
adafruit_itsybitsypicoprobe.upload.erase_cmd=
adafruit_itsybitsypicoprobe.serial.disableDTR=false
adafruit_itsybitsypicoprobe.serial.disableRTS=false
adafruit_itsybitsypicoprobe.build.f_cpu=125000000
adafruit_itsybitsypicoprobe.build.led=
adafruit_itsybitsypicoprobe.build.core=rp2040
adafruit_itsybitsypicoprobe.build.mcu=rp2040
adafruit_itsybitsypicoprobe.build.ldscript=memmap_default.ld
adafruit_itsybitsypicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
adafruit_itsybitsypicoprobe.build.vid=0x239a
adafruit_itsybitsypicoprobe.build.pid=0x80fd
adafruit_itsybitsypicoprobe.build.usb_manufacturer="Adafruit"
adafruit_itsybitsypicoprobe.build.usb_product="ItsyBitsy RP2040 (Picoprobe)"
adafruit_itsybitsypicoprobe.menu.flash.8388608_0=8MB (no FS)
adafruit_itsybitsypicoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
adafruit_itsybitsypicoprobe.menu.flash.8388608_0.build.flash_length=8384512
adafruit_itsybitsypicoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_0.build.fs_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_0.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
adafruit_itsybitsypicoprobe.menu.flash.8388608_65536.build.flash_length=8318976
adafruit_itsybitsypicoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_65536.build.fs_start=276754432
adafruit_itsybitsypicoprobe.menu.flash.8388608_65536.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
adafruit_itsybitsypicoprobe.menu.flash.8388608_131072.build.flash_length=8253440
adafruit_itsybitsypicoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_131072.build.fs_start=276688896
adafruit_itsybitsypicoprobe.menu.flash.8388608_131072.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
adafruit_itsybitsypicoprobe.menu.flash.8388608_262144.build.flash_length=8122368
adafruit_itsybitsypicoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_262144.build.fs_start=276557824
adafruit_itsybitsypicoprobe.menu.flash.8388608_262144.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
adafruit_itsybitsypicoprobe.menu.flash.8388608_524288.build.flash_length=7860224
adafruit_itsybitsypicoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_524288.build.fs_start=276295680
adafruit_itsybitsypicoprobe.menu.flash.8388608_524288.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
adafruit_itsybitsypicoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
adafruit_itsybitsypicoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
adafruit_itsybitsypicoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
adafruit_itsybitsypicoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
adafruit_itsybitsypicoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
adafruit_itsybitsypicoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
adafruit_itsybitsypicoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
adafruit_itsybitsypicoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
adafruit_itsybitsypicoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
adafruit_itsybitsypicoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
adafruit_itsybitsypicoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
adafruit_itsybitsypicoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
adafruit_itsybitsypicoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
adafruit_itsybitsypicoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
adafruit_itsybitsypicoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
adafruit_itsybitsypicoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
adafruit_itsybitsypicoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
adafruit_itsybitsypicoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
adafruit_itsybitsypicoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
adafruit_itsybitsypicoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
adafruit_itsybitsypicoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
adafruit_itsybitsypicoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
adafruit_itsybitsypicoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
adafruit_itsybitsypicoprobe.menu.freq.125=125 MHz
adafruit_itsybitsypicoprobe.menu.freq.125.build.f_cpu=125000000L
adafruit_itsybitsypicoprobe.menu.freq.50=50 MHz
adafruit_itsybitsypicoprobe.menu.freq.50.build.f_cpu=50000000L
adafruit_itsybitsypicoprobe.menu.freq.100=100 MHz
adafruit_itsybitsypicoprobe.menu.freq.100.build.f_cpu=100000000L
adafruit_itsybitsypicoprobe.menu.freq.133=133 MHz
adafruit_itsybitsypicoprobe.menu.freq.133.build.f_cpu=133000000L
adafruit_itsybitsypicoprobe.menu.freq.150=150 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.150.build.f_cpu=150000000L
adafruit_itsybitsypicoprobe.menu.freq.175=175 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.175.build.f_cpu=175000000L
adafruit_itsybitsypicoprobe.menu.freq.200=200 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.200.build.f_cpu=200000000L
adafruit_itsybitsypicoprobe.menu.freq.225=225 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.225.build.f_cpu=225000000L
adafruit_itsybitsypicoprobe.menu.freq.250=250 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.250.build.f_cpu=250000000L
adafruit_itsybitsypicoprobe.menu.freq.275=275 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.275.build.f_cpu=275000000L
adafruit_itsybitsypicoprobe.menu.freq.300=300 MHz (Overclock)
adafruit_itsybitsypicoprobe.menu.freq.300.build.f_cpu=300000000L
adafruit_itsybitsypicoprobe.menu.dbgport.Disabled=Disabled
adafruit_itsybitsypicoprobe.menu.dbgport.Disabled.build.debug_port=
adafruit_itsybitsypicoprobe.menu.dbgport.Serial=Serial
adafruit_itsybitsypicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_itsybitsypicoprobe.menu.dbgport.Serial1=Serial1
adafruit_itsybitsypicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_itsybitsypicoprobe.menu.dbgport.Serial2=Serial2
adafruit_itsybitsypicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_itsybitsypicoprobe.menu.dbglvl.None=None
adafruit_itsybitsypicoprobe.menu.dbglvl.None.build.debug_level=
adafruit_itsybitsypicoprobe.menu.dbglvl.Core=Core
adafruit_itsybitsypicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_itsybitsypicoprobe.menu.dbglvl.SPI=SPI
adafruit_itsybitsypicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_itsybitsypicoprobe.menu.dbglvl.Wire=Wire
adafruit_itsybitsypicoprobe.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
adafruit_itsybitsypicoprobe.menu.dbglvl.All=All
adafruit_itsybitsypicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
adafruit_itsybitsypicoprobe.menu.dbglvl.NDEBUG=NDEBUG
adafruit_itsybitsypicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_itsybitsypicoprobe.menu.usbstack.picosdk=Pico SDK
adafruit_itsybitsypicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_itsybitsypicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_itsybitsypicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{build.core.path}/TinyUSB" "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"

